from crawler.exportExcel import export_product_excel
from crawler.stringgetter import get_page_string
from bs4 import BeautifulSoup
import time

depth = [('445726', '445626', '강아지 사료', '건식사료', '건식사료', '건식사료'),
         ('445727', '445627', '강아지 사료', '소프트사료', '소프트사료', '소프트사료'),
         ('445728', '445628', '강아지 사료', '습식사료', '습식사료', '습식사료'),
         ('445731', '445631', '강아지 사료', '분유', '분유', '분유'),
         ('119018', '121434', '강아지 간식', '캔/파우치', '캔', '캔'),
         ('119019', '121435', '강아지 간식', '캔/파우치', '파우치', '파우치'),
         ('385001', '384901', '강아지 간식', '덴탈껌', '덴탈껌', '덴탈껌'),
         ('385002', '384902', '강아지 간식', '건조간식/육포', '건조간식/육포', '건조간식/육포'),
         ('385003', '384903', '강아지 간식', '동결건조간식', '동결건조간식', '동결건조간식'),
         ('118974', '121427', '강아지 간식', '비스킷/시리얼/쿠키', '비스킷/시리얼/쿠키', '비스킷/시리얼/쿠키'),
         ('225063', '224963', '강아지 간식', '캔디/젤리', '캔디/젤리', '캔디/젤리'),
         ('385004', '384904', '강아지 간식', '져키/트릿', '져키/트릿', '져키/트릿'),
         ('118980', '121447', '강아지 간식', '음료', '음료', '음료'),
         ('486320', '486220', '강아지 영양제', '영양제', '종합영양제', '종합영양제'),
         ('486321', '486221', '강아지 영양제', '영양제', '칼슘/관절영양제', '칼슘/관절영양제'),
         ('486330', '486230', '강아지 영양제', '건강보조제', '구충제', '구충제'),
         ('119254', '121569', '강아지 용품', '하우스/울타리', '하우스', '쿠션하우스'),
         ('119255', '121570', '강아지 용품', '하우스/울타리', '하우스', '하드하우스'),
         ('119248', '121572', '강아지 용품', '하우스/울타리', '쿠션/방석', '쿠션/방석'),
         ('119251', '121575', '강아지 용품', '하우스/울타리', '담요/이불', '담요/이불'),
         ('419203', '419103', '강아지 용품', '하우스/울타리', '울타리', '울타리'),
         ('373677', '373577', '강아지 용품', '급식기/급수기', '식탁', '식탁'),
         ('119234', '121546', '강아지 용품', '급식기/급수기', '식기', '스테인리스 식기'),
         ('119233', '121545', '강아지 용품', '급식기/급수기', '식기', '플라스틱 식기'),
         ('119212', '121554', '강아지 용품', '급식기/급수기', '물병/급수기/급식기', '물병/급수기/급식기'),
         ('119211', '121553', '강아지 용품', '급식기/급수기', '젖병', '젖병'),
         ('373633', '373533', '강아지 용품', '의류/패션', '올인원', '올인원'),
         ('373636', '373536', '강아지 용품', '의류/패션', '원피스/드레스', '원피스/드레스'),
         ('373639', '373539', '강아지 용품', '의류/패션', '코스튬 의류', '코스튬 의류'),
         ('119385', '121658', '강아지 용품', '의류/패션', '패션 악세서리/기타', '반다나/스카프'),
         ('119093', '121474', '강아지 용품', '배변용품', '배변판', '배변판'),
         ('119092', '121473', '강아지 용품', '배변용품', '배변패드', '배변패드'),
         ('119096', '121477', '강아지 용품', '배변용품', '탈취제/소독', '탈취제/소독'),
         ('119097', '121478', '강아지 용품', '배변용품', '물티슈', '물티슈'),
         ('385009', '384909', '강아지 용품', '배변용품', '항문세정제', '항문세정제'),
         ('119181', '121483', '강아지 용품', '미용/목욕', '샴푸/린스', '샴푸'),
         ('119182', '121484', '강아지 용품', '미용/목욕', '샴푸/린스', '린스/컨디셔너'),
         ('373644', '373544', '강아지 용품', '미용/목욕', '비누', '비누'),
         ('119310', '121610', '강아지 용품', '장난감/훈련용품', '볼', '볼'),
         ('120246', '121615', '강아지 용품', '장난감/훈련용품', '노즈워크/IQ 장난감', '노즈워크/IQ 장난감'),
         ('119311', '121611', '강아지 용품', '장난감/훈련용품', '로프/치실장난감', '로프/치실장난감'),
         ('119313', '121613', '강아지 용품', '장난감/훈련용품', '라텍스/고무장난감', '라텍스/고무장난감'),
         ('119314', '121614', '강아지 용품', '장난감/훈련용품', '봉제장난감', '봉제장난감'),
         ('119315', '121616', '강아지 용품', '장난감/훈련용품', '기타장난감', '기타장난감'),
         ('419390', '419290', '강아지 용품', '이동장/외출용품', '줄/하네스', '가슴줄/하네스'),
         ('419391', '419291', '강아지 용품', '이동장/외출용품', '줄,/하네스', '목줄'),
         ('419392', '419292', '강아지 용품', '이동장/외출용품', '줄,/하네스', '리드줄'),
         ('419393', '419293', '강아지 용품', '이동장/외출용품', '줄,/하네스', '자동줄'),
         ('445860', '445760', '고양이 사료', '건식사료', '건식사료', '건식사료'),
         ('119522', '121721', '고양이 간식', '캔', '캔', '캔'),
         ('119499', '121722', '고양이 간식', '파우치', '파우치', '파우치'),
         ('119502', '121725', '고양이 간식', '져키/스틱', '져키/스틱', '져키/스틱'),
         ('119505', '121728', '고양이 간식', '캣닢/캣글라스', '캣닢/캣글라스', '캣닢/캣글라스'),
         ('119574', '121760', '고양이 용품', '모래/화장식', '모래', '벤토나이트'),
         ('119577', '121763', '고양이 용품', '모래/화장식', '모래', '두부')]

url = "https://www.coupang.com/np/categories/{}?sorter=saleCountDesc&component={}"


def web_crawler_loop():
    result = []
    for tu in depth:
        page_string = get_page_string(url.format(tu[0], tu[1]))
        result.extend(get_products(page_string, tu[-4:]))
        time.sleep(1)
    return result


def get_products(string, category):
    bs_obj = BeautifulSoup(string, "html.parser")
    ul = bs_obj.find("ul", {"id": "productList"})  # 아이템 리스트부분 추출
    lis = ul.findAll("li", {"class": "baby-product renew-badge"})  # 각 아이템 추출

    products = []
    rank = 1
    for item in lis:
        # name
        div_name = item.find("div", {"class": "name"})
        name = div_name.getText()
        # print("name:", name.strip())

        # image
        dt_image = item.find("dt", {"class": "image"})
        image = dt_image.find("img").get('src')
        # print("image:", image)

        # price
        price = item.find("strong", {"class": "price-value"}).getText().replace(",", "")
        # print("price:", price)
        products.append({"순위": rank,
                         "제품명": name.strip(),
                         "제품이미지": "https:" + image,
                         "가격": price,
                         "출처": '쿠팡',
                         "구분1": category[0],
                         "구분2": category[1],
                         "구분3": category[2],
                         "구분4": category[3]})
        rank = rank + 1
    print('[쿠팡 - {} - {} - {} - {}] size = {}'
          .format(category[0], category[1], category[2], category[3], len(products)))
    return products


file_path = '../../../doc/coupang.xlsx'
export_product_excel(web_crawler_loop(), file_path)
